tests/pitzDaily/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar; //RAS;

//RAS
//{
//    // Tested with kEpsilon, realizableKE, kOmega, kOmegaSST, v2f,
//    // ShihQuadraticKE, LienCubicKE.
//    model           kEpsilon;
//
//    turbulence      on;
//
//    printCoeffs     on;
//}


// ************************************************************************* //
