tests/pitzDaily/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;
nu	nu	[0 2 -1 0 0 0 0] 6;


// lambda, rho, cp für Energiegleichung
lambda	lambda	[1 1 -3 -1 0 0 0] 0.157;
rho	rho	[1 -3 0 0 0 0 0] 780;
cp	cp	[0 2 -2 -1 0 0 0] 2780;;

// ************************************************************************* //
